<h3><center>Data Analysis with Pandas </center></h3>



<h4><center>Rija Shrestha</center></h4>
<h4><center>Presidential Graduate School, Kathmandu </center></h4>
<h4><center>PRG 330: Python Programming with Data </center></h4>
<h4><center> Prof. Tek Raj Pant </center></h4>
<h4><center> Novemeber 10, 2024</center></h4>

# Data Analysis with Pandas
## Import and use Pandas

In [7]:
import pandas as pd

# create new series
number_series = pd.Series([1,2,3,4])
print(number_series)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
import pandas as pd

# create new Data Frame
user_data_dict = {
    "Name":["Ram","Hari"],
    "Age":[20,23],
    "Address":["Kathmandu","Lalitpur"]
}
user_data = pd.DataFrame(user_data_dict)
print(user_data)

# to print specific columns or rows write user_data [column name or row number]

   Name  Age    Address
0   Ram   20  Kathmandu
1  Hari   23   Lalitpur

## Read Data From CSV, Excel and JASON file

### Read Data from CSV

In [2]:
# CSV 

import pandas as pd

student_csv_data = pd.read_csv('data/student.csv') #read 
student_csv_data.tail()

# read data from csv file

student_excel_data = pd.read_excel('data/student.xlsx')
print(student_excel_data.head())

# read data from json

student_json_data = pd.read_json('data/student.json')
print(student_excel_data.head())

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female
   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [3]:
# Create new DataFrame

user_data = pd.DataFrame({
    "Name":["Ram","Hari"],
    "Age": [20,23],
    "Address":["Kathmandu","Lalitpur"]
})

user_data.to_csv('data/user_data.csv')
user_data.to_excel('data/user_data.xlsx')
user_data.to_json('data/user_data.json')

# Basic Data Exploration
## Data Inspection

In [4]:
import pandas as pd
students = pd.read_csv('data/student.csv')
print(students.shape)                     #no of rows and coloumns # this type of [35,5]  is called tuple
print(students.head())                      #to print the top n=5 rows in default

#print (students.tail()) to print the last n=5 rows in default

print(students.info())                  #shows basic info lie no of rows, memory occupied.
students.describe()                     # describes the data mainly statistical calculation

(35, 5)
   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB
None

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

# Data Selection and Indexing in Pandas
* Basic Indexing
* Label-based Indexing (.loc[])
* Integer-Label-based Indexing (.iloc[])
* Single Value Access (.at[], .iat[])

### Basic Indexing  (either row or column)

In [ ]:
import pandas as pd

students = pd.read_csv('./data/student.csv')

# # Basic indexing
print(students['name'])                         # Single column as a Series

new_std_data = students[['id','name','mark']]
print(new_std_data)                             # Multiple columns as a DataFrame

# # # Slicing rows
first_10_rows = students[:10].copy()
print(first_10_rows)                            # only first row 
last_five_rows = students[30:].copy()
print(last_five_rows)                           # Rows from index 30 to lat index (dataframe)

    id         name  mark
0    1     John Deo    75
1    2     Max Ruin    85
2    3       Arnold    55
3    4   Krish Star    60
4    5    John Mike    60
5    6    Alex John    55
6    7  My John Rob    78
7    8       Asruid    85
8    9      Tes Qry    78
9   10     Big John    55
10  11       Ronald    89
11  12        Recky    94
12  13          Kty    88
13  14         Bigy    88
14  15     Tade Row    88
15  16        Gimmy    88
16  17        Tumyu    54
17  18        Honny    75
18  19        Tinny    18
19  20       Jackly    65
20  21   Babby John    69
21  22       Reggid    55
22  23        Herod    79
23  24    Tiddy Now    78
24  25     Giff Tow    88
25  26       Crelea    79
26  27     Big Nose    81
27  28    Rojj Base    86
28  29  Tess Played    55
29  30    Reppy Red    79
30  31  Marry Toeey    88
31  32    Binn Rott    90
32  33    Kenn Rein    96
33  34     Gain Toe    69
34  35   Rows Noump    88
   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
8   9      Tes Qry    Six    78    male
9  10     Big John   Four    55  female
    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

### Label-based Indexing (.loc[])      (both row and column but with location)
* **.loc[]** is used for selecting rows and columns by labels
* We can use single labels, list of labels, or slices of labels

In [11]:
# Selecting rows based on label
 
students = pd.read_csv("data/student.csv")
first_row = students.loc[1]
first_two_rows = students.loc[0:2]
print(first_row)
                              # Row with label 1(index) labels can be string, date etc 
print(first_two_rows)
# Rows with labels 1 to 2

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [10]:
# Selecting specific rows to columns

first_two_stds_with_name_to_marks = students.loc[0:5,'name':'mark']
print(first_two_stds_with_name_to_marks)    # Rows θ to 5 columns name to mark

# select only particular rows and columns
first_and_second_row_with_name_and_gender = students.loc[[5, 20], ['name','gender']] 

# Rows 5 and 20, columns name and gender
first_and_second_row_with_name_and_gender

         name  class  mark
0    John Deo   Four    75
1    Max Ruin  Three    85
2      Arnold  Three    55
3  Krish Star   Four    60
4   John Mike   Four    60
5   Alex John   Four    55

          name  gender
5    Alex John    male
20  Babby John  female

### Integer-location Based Indexing  (only index of row and column can be used without numbers)
* **iloc[]** is used for selecting rows and columns by integer index positions
* Similar to .loc[], we can use single integers, lists of integers, or slices

In [14]:
# Selecting rows based on index positions

print(students.iloc[1])                  # Second row (index 1)
print(students.iloc[0:3])                # Rows at index positions 0 to 2

# Selecting specific rows aná columns
print(students.iloc[0:2, 0:2])             # Rows 0 to 1, columns 0 to 1
print(students.iloc[[0, 2],[0, 2]])        # Rows 0 and 2, colunns o and 2

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male
   id      name
0   1  John Deo
1   2  Max Ruin
   id  class
0   1   Four
2   3  Three

### Single Value Access (.at[] and .iat[])
* at[] is used for accessing a single scalar value by label.
* .iat[] is for accessing by index position.

In [ ]:
# Using .at[] to access single value by label 

print(students.at[0, 'name'])         # value in row 2

# Using .iat to access single value by position 
print(students.iat[5, 1])

John Deo
Alex John

### Filtering
* Logical operators(>, <,==,!=)
* Multiple logical operators (&(AND) and |(OR))
* Str ancessor, lsin, contains, between, startWith
* Tilde (-)
* Query
* Nlargest and nsmallest
* Loc and iloc

### Logical Operators

In [19]:
# students with marks greater than 40

stds_marks_greater_than_40 = students[students.mark<40]
stds_marks_greater_than_40.head()

boys = students[students.gender=='male']

boys.head()

   id         name  class  mark gender
1   2     Max Ruin  Three    85   male
2   3       Arnold  Three    55   male
5   6    Alex John   Four    55   male
6   7  My John Rob  Fifth    78   male
7   8       Asruid   Five    85   male

In [20]:
# students with marks less than 40 and the list of students gender boys

stds_marks_less_than_40 = students [students.mark<40]
print (stds_marks_less_than_40.head())

boys = students[students.gender=='male']

boys.head()

    id   name class  mark gender
18  19  Tinny  Nine    18   male

   id         name  class  mark gender
1   2     Max Ruin  Three    85   male
2   3       Arnold  Three    55   male
5   6    Alex John   Four    55   male
6   7  My John Rob  Fifth    78   male
7   8       Asruid   Five    85   male

### Multiple Logical Operators

In [21]:
# students of class 'four' and have marks above 80

class_four_high_marks = students[ (students['class'] =='Four') & (students['mark'] > 80)]
class_four_high_marks.head()

    id         name class  mark gender
14  15     Tade Row  Four    88   male
15  16        Gimmy  Four    88   male
30  31  Marry Toeey  Four    88   male

In [ ]:
# Students of class 'four' and 'five' and have marks above 70

class_four_five_high_marks = students[((students['class'] =='Four') | (students['class']=='Five')) & (students['mark']>70)]
class_four_five_high_marks.head()

    id      name class  mark  gender
0    1  John Deo  Four    75  female
7    8    Asruid  Five    85    male
14  15  Tade Row  Four    88    male
15  16     Gimmy  Four    88    male
17  18     Honny  Five    75    male